// JavaScript Document
var pattern=new Object();
pattern.putong="/^\w+$/";	//由数字、26个英文字母或者下划线组成的字符串 
pattern.email="/^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/";	//email
pattern.cn_en_num="/^[\u4e00-\u9fa5_a-zA-Z0-9]+$/";	//中文、英文、数字及下划线
pattern.telephone="/^((\+?[0-9]{2,4}\-[0-9]{3,4}\-)|([0-9]{3,4}\-))?([0-9]{7,8})(\-[0-9]+)?$/";	//电话号码
pattern.date1="/^(d{2}|d{4})-((0([1-9]{1}))|(1[1|2]))-(([0-2]([1-9]{1}))|(3[0|1]))$/";	//年-月-日
pattern.date2="/^((0([1-9]{1}))|(1[1|2]))/(([0-2]([1-9]{1}))|(3[0|1]))/(d{2}|d{4})$/";	// 月/日/年
pattern.ip="/^(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5])$/";   //IP地址
pattern.qq="/^[1-9]*[1-9][0-9]*$/";	//QQ
pattern.mobile_phone="/^((\(\d{2,3}\))|(\d{3}\-))?13\d{9}$/";	//移动手机
pattern.zhcn="/[\u4e00-\u9fa5]/";	//中文
